Linux/LinuxCoding/process.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+include "../../template.org"
#+title: Unix环境高级编程－进程基础与控制

* atexit
  用来注册函数，当_exit被调用时这些注册的函数会被调用，调用顺序与注册顺序相反。
* 取得、设置、删除环境变量
  * getenv
  用来获取环境变量（保存在环境列表中，形式为 name=value）
  printf ("%s\n",getenv("HOME"));
  * setenv用来设置环境变量：
  int setenv(const char *name, const char *value, int overwrite);//overwrite为正则表覆盖
  * putenv以name=value形式来设置环境变量
  int putenv(char *string);
  * unsetenv用来删除环境变量：
  int unsetenv(const char *name);
  *获得当前程序所有环境变量*
#+begin_src c
    extern char** environ;
    char **ppc = environ;
    while(*ppc)
        printf ("%s\n",*ppc++);
#+end_src  
* 从输入流中获取字符（串）
  int fgetc(FILE *stream);
  int getc(FILE *stream);
  int getchar(void);
  getc等价于fgetc，getchar等价于getc(stdin)
  
  char *fgets(char *s, int size, FILE *stream);
  char *gets(char *s);
  gets从stdin中获取字符串，遇到换行或者EOF停止。fgets指定最多接收size-1个字符（最后以NULL结尾）
  使用gets函数编译时会提示警告gets函数很危险应当小心使用。因为它没有指定大小，容易越界。
  get成功则返回s，出错或没有字符读入则返回NULL。

  int ungetc(int c, FILE *stream);
  退回c到stream中
* 向输出流中put字符
  int fputc(int c, FILE *stream);
  int putc(int c, FILE *stream);
  向stream中放一个字符
  int putchar(int c);
  等价于putc(c, stdout)
  
  int fputs(const char *s, FILE *stream);
  向stream中放一个字符串
  int puts(const char *s);
  等价于fputs(s, stdout)
* setjmp/longjmp
  首先定义一个jmp_buf结构体类型的变量，set_jmp如果不是从longjmp函数返回调用会初始化jmp_buf变量且返回值是0，如果从longjmp函数返回调用则返回值非0.
#+begin_src c
#include <stdio.h>
#include <stdlib.h>
#include <setjmp.h>
jmp_buf jmpbuffer;
void error_occured();

typedef int aaa[8];
int main(int argc, char *argv[])
{
    if(setjmp(jmpbuffer) != 0){
        printf ("%s\n","error occured");
        exit(0);
    }
    printf ("%s\n","this line shows");
    int i;
    for(i=0; i<sizeof(aaa)/sizeof(int); i++)
        aaa[i]=i;
    for(i=0; i<sizeof(aaa)/sizeof(int); i++)
        printf("%d ", aaa[i]);
        
    error_occured();
    printf ("%s\n","this line doesn't show");
    return 0;
}
void error_occured(){
    longjmp(jmpbuffer, 1);
}
#+end_src
