Linux/LinuxCoding/process.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Unix环境高级编程－进程基础与控制</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Unix环境高级编程－进程基础与控制"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:05:20 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#linuxcoding">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">Unix环境高级编程－进程基础与控制</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 atexit</a></li>
<li><a href="#sec-2">2 取得、设置、删除环境变量</a></li>
<li><a href="#sec-3">3 从输入流中获取字符（串）</a></li>
<li><a href="#sec-4">4 向输出流中put字符</a></li>
<li><a href="#sec-5">5 setjmp/longjmp</a></li>
<li><a href="#sec-6">6 资源界限</a></li>
<li><a href="#sec-7">7 fork</a></li>
<li><a href="#sec-8">8 wait/waitpid</a></li>
<li><a href="#sec-9">9 waitid</a></li>
<li><a href="#sec-10">10 wait3/wait4</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> atexit</h2>
<div class="outline-text-2" id="text-1">

<p>  用来注册函数，当_exit被调用时这些注册的函数会被调用，调用顺序与注册顺序相反。<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 取得、设置、删除环境变量</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>getenv<br/>
</li>
</ul>

<p>  用来获取环境变量（保存在环境列表中，形式为 name=value）<br/>
  printf ("%s\n",getenv("HOME"));<br/>
</p><ul>
<li>setenv用来设置环境变量：<br/>
</li>
</ul>

<p>  int setenv(const char *name, const char *value, int overwrite);//overwrite为正则表覆盖<br/>
</p><ul>
<li>putenv以name=value形式来设置环境变量<br/>
</li>
</ul>

<p>  int putenv(char *string);<br/>
</p><ul>
<li>unsetenv用来删除环境变量：<br/>
</li>
</ul>

<p>  int unsetenv(const char <b>name);   *获得当前程序所有环境变量</b><br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">extern</span> <span style="color: #228b22;">char</span>** <span style="color: #a0522d;">environ</span>;
<span style="color: #228b22;">char</span> **<span style="color: #a0522d;">ppc</span> = environ;
<span style="color: #a020f0;">while</span>(*ppc)
    printf (<span style="color: #8b2252;">"%s\n"</span>,*ppc++);
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 从输入流中获取字符（串）</h2>
<div class="outline-text-2" id="text-3">

<p>  int fgetc(FILE *stream);<br/>
  int getc(FILE *stream);<br/>
  int getchar(void);<br/>
  getc等价于fgetc，getchar等价于getc(stdin)<br/>
</p>
<p>  <br/>
  char *fgets(char *s, int size, FILE *stream);<br/>
  char *gets(char *s);<br/>
  gets从stdin中获取字符串，遇到换行或者EOF停止。fgets指定最多接收size-1个字符（最后以NULL结尾）<br/>
  使用gets函数编译时会提示警告gets函数很危险应当小心使用。因为它没有指定大小，容易越界。<br/>
  get成功则返回s，出错或没有字符读入则返回NULL。<br/>
</p>
<p>
  int ungetc(int c, FILE *stream);<br/>
  退回c到stream中<br/>
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 向输出流中put字符</h2>
<div class="outline-text-2" id="text-4">

<p>  int fputc(int c, FILE *stream);<br/>
  int putc(int c, FILE *stream);<br/>
  向stream中放一个字符<br/>
  int putchar(int c);<br/>
  等价于putc(c, stdout)<br/>
</p>
<p>  <br/>
  int fputs(const char *s, FILE *stream);<br/>
  向stream中放一个字符串<br/>
  int puts(const char *s);<br/>
  等价于fputs(s, stdout)<br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> setjmp/longjmp</h2>
<div class="outline-text-2" id="text-5">

<p>  首先定义一个jmp_buf结构体类型的变量，set_jmp如果不是从longjmp函数返回调用会初始化jmp_buf变量且返回值是0，如果从longjmp函数返回调用则返回值非0.<br/>
</p>


<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;setjmp.h&gt;</span>
<span style="color: #228b22;">jmp_buf</span> <span style="color: #a0522d;">jmpbuffer</span>;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">error_occured</span>();

<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int</span> <span style="color: #228b22;">aaa</span>[8];
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    <span style="color: #a020f0;">if</span>(setjmp(jmpbuffer) != 0){
        printf (<span style="color: #8b2252;">"%s\n"</span>,<span style="color: #8b2252;">"error occured"</span>);
        exit(0);
    }
    printf (<span style="color: #8b2252;">"%s\n"</span>,<span style="color: #8b2252;">"this line shows"</span>);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #a020f0;">for</span>(i=0; i&lt;<span style="color: #a020f0;">sizeof</span>(aaa)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>); i++)
        aaa[i]=i;
    <span style="color: #a020f0;">for</span>(i=0; i&lt;<span style="color: #a020f0;">sizeof</span>(aaa)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>); i++)
        printf(<span style="color: #8b2252;">"%d "</span>, aaa[i]);

    error_occured();
    printf (<span style="color: #8b2252;">"%s\n"</span>,<span style="color: #8b2252;">"this line doesn't show"</span>);
    <span style="color: #a020f0;">return</span> 0;
}
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">error_occured</span>(){
    longjmp(jmpbuffer, 1);
}
</pre>

</div>

</div>
