Linux/LinuxCoding/process.org
* 资源界限
  参考[[../kernel/process.html#sec-9][Linux内核－进程管理基础]]
#+begin_html
<a href="#ModalID1" class="btn" data-toggle="modal">打印资源界限</a>
<div id="ModalID1" class="modal hide">
<div class="modal-header">
<button type="button" class="close" data-dismiss="modal">x</button>
<h3></h3>
</div>
<div class="modal-body">
#+end_html
#+begin_src c -n
#include <stdio.h>
#include <sys/resource.h>
#include <sys/time.h>
#include <stdlib.h>
#include <setjmp.h>

#define doit(name) pr_lmt(#name, name) /* #字符串创建运算符 */
#define err_sys(error_msg) {printf("%s",error_msg); return;}

void pr_lmt(char* name, int rsc){
    struct rlimit rlmt;
    if(getrlimit(rsc, &rlmt)<0)
        err_sys(name)
    printf("%-20s ", name);
    if(rlmt.rlim_cur == RLIM_INFINITY)
        printf("%13s","Infinity");
    else
        printf("%13d", rlmt.rlim_cur);
    if(rlmt.rlim_max == RLIM_INFINITY)
        printf("%13s","Infinity");
    else
        printf("%13d", rlmt.rlim_max);
    putchar((int)'\n');
}
int main(int argc, char *argv[])
{
    doit(RLIMIT_AS);            /* 最大进程地址空间 address space */
    doit(RLIMIT_CORE);           /* 最大core文件大小 */
    doit(RLIMIT_CPU);            /* 最大CPU时间，秒为单位 */
    doit(RLIMIT_DATA);           /* 最大数据段 */
    doit(RLIMIT_FSIZE);          /* 进程创建的最大文件大小 */
    doit(RLIMIT_MEMLOCK);        /* 锁住内存的最大区域 */
    doit(RLIMIT_MSGQUEUE);       /* 最大消息队列 */
    doit(RLIMIT_NICE);           /* 最大nice值 */
    doit(RLIMIT_NOFILE);         /* 最多文件数 */
    doit(RLIMIT_NPROC);          /* 最多进程数 */
    doit(RLIMIT_RTPRIO);          /* 实时优先级 */
    doit(RLIMIT_STACK);          /* 进程最大栈大小 */
    return 0;
}
#+end_src
#+begin_html
</div>
<div class="modal-footer">
<a href="#" class="btn" data-dismiss="modal">Close</a>
</div>
</div>
#+end_html
  命令行下可以用ulimit -a命令查看资源限制
* fork
  链接：[[fork.html][一道fork面试题]]
#+begin_src c
#include <stdio.h>
#include <unistd.h>

int glb = 1;
int main(int argc, char *argv[])
{
    pid_t pid;
    printf("pid=%d, glb=%d\n", getpid(), glb);
    if((pid=fork())==0){
        glb++;
    }else{
        sleep(2);
    }
    printf("pid=%d, glb=%d\n", getpid(), glb);
    return 0;
}
#+end_src
  结果：
#+begin_example
pid=8208, glb=1
pid=8209, glb=2
pid=8208, glb=1
#+end_example
  先是父进程执行fork前的printf，fork后由于了进程拷贝了父进程的进程空间（包括程序计数器，即fork之前的代码子进程不会执行，只会执行fork后面的代码），之后由于父进程sleep2秒，假设系统不忙的话，2s之内子进程会执行（如果系统忙的话，2s之内可能子进程仍没有执行，之后父子哪个先是不确定的）。
  但如果命令行下 a.out > text.txt，则text.txt中的结果是：
#+begin_example
pid=8212, glb=1
pid=8213, glb=2
pid=8212, glb=1
pid=8212, glb=1
#+end_example
  pid=8212, glb=1出现两次，原因是重定向的时候先把欲定向的内容存放在缓冲中，子进程被fork的时候拷贝了父进程的缓冲区内容，最后冲刷的时候出现两个。
