Linux/LinuxCoding/process.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 资源界限</h2>
<div class="outline-text-2" id="text-6">

<p>  参考<a href="../kernel/process.html#sec-9">Linux内核－进程管理基础</a><br/>
<a href="#ModalID1" class="btn" data-toggle="modal">打印资源界限</a>
<div id="ModalID1" class="modal hide">
<div class="modal-header">
<button type="button" class="close" data-dismiss="modal">x</button>
<h3></h3>
</div>
<div class="modal-body">

<pre class="src src-c"><span class="linenr"> 1:  </span><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span class="linenr"> 2:  </span><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;sys/resource.h&gt;</span>
<span class="linenr"> 3:  </span><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;sys/time.h&gt;</span>
<span class="linenr"> 4:  </span><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span class="linenr"> 5:  </span><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;setjmp.h&gt;</span>
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">doit</span>(<span style="color: #a0522d;">name</span>) pr_lmt(#name, name) <span style="color: #b22222;">/* </span><span style="color: #b22222;">#&#23383;&#31526;&#20018;&#21019;&#24314;&#36816;&#31639;&#31526; </span><span style="color: #b22222;">*/</span>
<span class="linenr"> 8:  </span><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">err_sys</span>(<span style="color: #a0522d;">error_msg</span>) {printf(<span style="color: #8b2252;">"%s"</span>,error_msg); <span style="color: #a020f0;">return</span>;}
<span class="linenr"> 9:  </span>
<span class="linenr">10:  </span><span style="color: #228b22;">void</span> <span style="color: #0000ff;">pr_lmt</span>(<span style="color: #228b22;">char</span>* <span style="color: #a0522d;">name</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rsc</span>){
<span class="linenr">11:  </span>    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">rlimit</span> <span style="color: #a0522d;">rlmt</span>;
<span class="linenr">12:  </span>    <span style="color: #a020f0;">if</span>(getrlimit(rsc, &amp;rlmt)&lt;0)
<span class="linenr">13:  </span>        err_sys(name)
<span class="linenr">14:  </span>    printf(<span style="color: #8b2252;">"%-20s "</span>, name);
<span class="linenr">15:  </span>    <span style="color: #a020f0;">if</span>(rlmt.rlim_cur == RLIM_INFINITY)
<span class="linenr">16:  </span>        printf(<span style="color: #8b2252;">"%13s"</span>,<span style="color: #8b2252;">"Infinity"</span>);
<span class="linenr">17:  </span>    <span style="color: #a020f0;">else</span>
<span class="linenr">18:  </span>        printf(<span style="color: #8b2252;">"%13d"</span>, rlmt.rlim_cur);
<span class="linenr">19:  </span>    <span style="color: #a020f0;">if</span>(rlmt.rlim_max == RLIM_INFINITY)
<span class="linenr">20:  </span>        printf(<span style="color: #8b2252;">"%13s"</span>,<span style="color: #8b2252;">"Infinity"</span>);
<span class="linenr">21:  </span>    <span style="color: #a020f0;">else</span>
<span class="linenr">22:  </span>        printf(<span style="color: #8b2252;">"%13d"</span>, rlmt.rlim_max);
<span class="linenr">23:  </span>    putchar((<span style="color: #228b22;">int</span>)<span style="color: #8b2252;">'\n'</span>);
<span class="linenr">24:  </span>}
<span class="linenr">25:  </span><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
<span class="linenr">26:  </span>{
<span class="linenr">27:  </span>    doit(RLIMIT_AS);            <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;&#36827;&#31243;&#22320;&#22336;&#31354;&#38388; address space </span><span style="color: #b22222;">*/</span>
<span class="linenr">28:  </span>    doit(RLIMIT_CORE);           <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;core&#25991;&#20214;&#22823;&#23567; </span><span style="color: #b22222;">*/</span>
<span class="linenr">29:  </span>    doit(RLIMIT_CPU);            <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;CPU&#26102;&#38388;&#65292;&#31186;&#20026;&#21333;&#20301; </span><span style="color: #b22222;">*/</span>
<span class="linenr">30:  </span>    doit(RLIMIT_DATA);           <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;&#25968;&#25454;&#27573; </span><span style="color: #b22222;">*/</span>
<span class="linenr">31:  </span>    doit(RLIMIT_FSIZE);          <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#36827;&#31243;&#21019;&#24314;&#30340;&#26368;&#22823;&#25991;&#20214;&#22823;&#23567; </span><span style="color: #b22222;">*/</span>
<span class="linenr">32:  </span>    doit(RLIMIT_MEMLOCK);        <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#38145;&#20303;&#20869;&#23384;&#30340;&#26368;&#22823;&#21306;&#22495; </span><span style="color: #b22222;">*/</span>
<span class="linenr">33:  </span>    doit(RLIMIT_MSGQUEUE);       <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;&#28040;&#24687;&#38431;&#21015; </span><span style="color: #b22222;">*/</span>
<span class="linenr">34:  </span>    doit(RLIMIT_NICE);           <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22823;nice&#20540; </span><span style="color: #b22222;">*/</span>
<span class="linenr">35:  </span>    doit(RLIMIT_NOFILE);         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22810;&#25991;&#20214;&#25968; </span><span style="color: #b22222;">*/</span>
<span class="linenr">36:  </span>    doit(RLIMIT_NPROC);          <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26368;&#22810;&#36827;&#31243;&#25968; </span><span style="color: #b22222;">*/</span>
<span class="linenr">37:  </span>    doit(RLIMIT_RTPRIO);          <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#23454;&#26102;&#20248;&#20808;&#32423; </span><span style="color: #b22222;">*/</span>
<span class="linenr">38:  </span>    doit(RLIMIT_STACK);          <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#36827;&#31243;&#26368;&#22823;&#26632;&#22823;&#23567; </span><span style="color: #b22222;">*/</span>
<span class="linenr">39:  </span>    <span style="color: #a020f0;">return</span> 0;
<span class="linenr">40:  </span>}
</pre>

</div>
<div class="modal-footer">
<a href="#" class="btn" data-dismiss="modal">Close</a>
</div>
</div>
  命令行下可以用ulimit -a命令查看资源限制<br/>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> fork</h2>
<div class="outline-text-2" id="text-7">

<p>  链接：<a href="#fork.html">一道fork面试题</a><br/>
</p>


<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;unistd.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #a0522d;">glb</span> = 1;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    <span style="color: #228b22;">pid_t</span> <span style="color: #a0522d;">pid</span>;
    printf(<span style="color: #8b2252;">"pid=%d, glb=%d\n"</span>, getpid(), glb);
    <span style="color: #a020f0;">if</span>((pid=fork())==0){
        glb++;
    }<span style="color: #a020f0;">else</span>{
        sleep(2);
    }
    printf(<span style="color: #8b2252;">"pid=%d, glb=%d\n"</span>, getpid(), glb);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>

<p>
  结果：<br/>
</p>


<pre class="example">pid=8208, glb=1
pid=8209, glb=2
pid=8208, glb=1
</pre>

<p>
  先是父进程执行fork前的printf，fork后由于了进程拷贝了父进程的进程空间（包括程序计数器，即fork之前的代码子进程不会执行，只会执行fork后面的代码），之后由于父进程sleep2秒，假设系统不忙的话，2s之内子进程会执行（如果系统忙的话，2s之内可能子进程仍没有执行，之后父子哪个先是不确定的）。<br/>
  但如果命令行下 a.out &gt; text.txt，则text.txt中的结果是：<br/>
</p>


<pre class="example">pid=8212, glb=1
pid=8213, glb=2
pid=8212, glb=1
pid=8212, glb=1
</pre>

<p>
  pid=8212, glb=1出现两次，原因是重定向的时候先把欲定向的内容存放在缓冲中，子进程被fork的时候拷贝了父进程的缓冲区内容，最后冲刷的时候出现两个。<br/>
</p></div>

</div>
