Linux/LinuxCoding/process.org
* wait/waitpid
  pid_t wait(int *status);
  如果子进程仍活着，则wait将悬挂父进程，直到了进程退出或者调用exec，子进程状态保存在status指向int中。如果子进程已经终止则释放其资源并返回（如果没有wait则子进程将变成zombie进程）。
  pid_t waitpid(pid_t pid, int *status, int options);
  与wait不同在于可以指定等待退出进程的id，可以通过options选项选择是否悬挂父进程。
  若pid=-1表任意子进程终止则退出悬挂，0表示任意一与父进程同进程组的子进程终止则退出悬挂；<-1表示任一组id＝pid绝对值的子进程终止则退出悬挂；>0则表示指定进程号。
  options为1表父进程并不悬挂，0表悬挂。
  故wait等价于waitpid(-1,status,0)
#+begin_html
<a href="#MOdal2" class="btn" data-toggle="modal">代码：通过宏来查看子进程退出状态</a>
<div id="MOdal2" class="modal hide">
<div class="modal-header">
<button type="button" class="close" data-dismiss="modal">x</button>
<h3></h3>
</div>
<div class="modal-body">
#+end_html
#+begin_src c
#include <stdio.h>
#include <sys/wait.h>
#include <unistd.h>
void pr_exit(int status){
    if(WIFEXITED(status))       /* 正常exit，exit code可以用 WEXITSTATUS(status)宏得到 */
        printf("normal termination, exit code %d\n", WEXITSTATUS(status));
    if(WIFSIGNALED(status))     /* 信号引发非正常终止，exit code可以用 WTERMSIG(status)得到 */
        printf("abnormal termination, exit code %d\n", WTERMSIG(status));
    if(WCOREDUMP(status))       /* 是否产生core dump */
        printf("core dump produced");
    if(WIFSTOPPED(status))      /* 是否为TASK_STOPPED状态 */
        printf("stopped by a signal, signal code %d\n", WSTOPSIG(status));
    if(WIFCONTINUED(status))    /* 是否通过信号SIGCONT激活进程 */
        printf("resumed by signal SIGCONT\n");        
}

int main(int argc, char *argv[])
{
    pid_t pid;
    int status;

    if((pid=fork())==0)
        exit(7);
    if(wait(&status) == pid)
        pr_exit(status);

    if((pid=fork())==0)
        abort();                /* 异常退赔，abort对应6 */
    if(wait(&status) == pid)
        pr_exit(status);
    if((pid=fork())==0)
        status /= 0;            /* 除0，对应代码8 */
    if(wait(&status) == pid)
        pr_exit(status);
    return 0;
}
#+end_src
  运行结果：
#+begin_example
normal termination, exit code 7
abnormal termination, exit code 6
abnormal termination, exit code 8
#+end_example  
#+begin_html
</div>
<div class="modal-footer">
<a href="#" class="btn" data-dismiss="modal">Close</a>
</div>
</div>
#+end_html
* waitid
  int waitid(idtype_t idtype, id_t id, siginfo_t *infop, int options);
  wait与waitpid功能差不多，只是不像waitpid用-1 0 >0 <-1来表示是任一子进程还是组id还是进程id，而是通过idtype来指明：
  P_PID表是进程ID，此时id为进程id号
  P_PGID表进程组，此时id表进程组的id
  P_ALL表明任一进程，此时id无效
