Linux/LinuxCoding/process.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> wait/waitpid</h2>
<div class="outline-text-2" id="text-8">

<p>  pid_t wait(int *status);<br/>
  如果子进程仍活着，则wait将悬挂父进程，直到了进程退出或者调用exec，子进程状态保存在status指向int中。如果子进程已经终止则释放其资源并返回（如果没有wait则子进程将变成zombie进程）。<br/>
  pid_t waitpid(pid_t pid, int *status, int options);<br/>
  与wait不同在于可以指定等待退出进程的id，可以通过options选项选择是否悬挂父进程。<br/>
  若pid=-1表任意子进程终止则退出悬挂，0表示任意一与父进程同进程组的子进程终止则退出悬挂；&lt;-1表示任一组id＝pid绝对值的子进程终止则退出悬挂；&gt;0则表示指定进程号。<br/>
  options为1表父进程并不悬挂，0表悬挂。<br/>
  故wait等价于waitpid(-1,status,0)<br/>
<a href="#MOdal2" class="btn" data-toggle="modal">代码：通过宏来查看子进程退出状态</a>
<div id="MOdal2" class="modal hide">
<div class="modal-header">
<button type="button" class="close" data-dismiss="modal">x</button>
<h3></h3>
</div>
<div class="modal-body">

<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;sys/wait.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;unistd.h&gt;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">pr_exit</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">status</span>){
    <span style="color: #a020f0;">if</span>(WIFEXITED(status))       <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#27491;&#24120;exit&#65292;exit code&#21487;&#20197;&#29992; WEXITSTATUS(status)&#23439;&#24471;&#21040; </span><span style="color: #b22222;">*/</span>
        printf(<span style="color: #8b2252;">"normal termination, exit code %d\n"</span>, WEXITSTATUS(status));
    <span style="color: #a020f0;">if</span>(WIFSIGNALED(status))     <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20449;&#21495;&#24341;&#21457;&#38750;&#27491;&#24120;&#32456;&#27490;&#65292;exit code&#21487;&#20197;&#29992; WTERMSIG(status)&#24471;&#21040; </span><span style="color: #b22222;">*/</span>
        printf(<span style="color: #8b2252;">"abnormal termination, exit code %d\n"</span>, WTERMSIG(status));
    <span style="color: #a020f0;">if</span>(WCOREDUMP(status))       <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26159;&#21542;&#20135;&#29983;core dump </span><span style="color: #b22222;">*/</span>
        printf(<span style="color: #8b2252;">"core dump produced"</span>);
    <span style="color: #a020f0;">if</span>(WIFSTOPPED(status))      <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26159;&#21542;&#20026;TASK_STOPPED&#29366;&#24577; </span><span style="color: #b22222;">*/</span>
        printf(<span style="color: #8b2252;">"stopped by a signal, signal code %d\n"</span>, WSTOPSIG(status));
    <span style="color: #a020f0;">if</span>(WIFCONTINUED(status))    <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#26159;&#21542;&#36890;&#36807;&#20449;&#21495;SIGCONT&#28608;&#27963;&#36827;&#31243; </span><span style="color: #b22222;">*/</span>
        printf(<span style="color: #8b2252;">"resumed by signal SIGCONT\n"</span>);        
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    <span style="color: #228b22;">pid_t</span> <span style="color: #a0522d;">pid</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">status</span>;

    <span style="color: #a020f0;">if</span>((pid=fork())==0)
        exit(7);
    <span style="color: #a020f0;">if</span>(wait(&amp;status) == pid)
        pr_exit(status);

    <span style="color: #a020f0;">if</span>((pid=fork())==0)
        abort();                <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#24322;&#24120;&#36864;&#36180;&#65292;abort&#23545;&#24212;6 </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">if</span>(wait(&amp;status) == pid)
        pr_exit(status);
    <span style="color: #a020f0;">if</span>((pid=fork())==0)
        status /= 0;            <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#38500;0&#65292;&#23545;&#24212;&#20195;&#30721;8 </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">if</span>(wait(&amp;status) == pid)
        pr_exit(status);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>

  运行结果：<br/>
</p>


<pre class="example">normal termination, exit code 7
abnormal termination, exit code 6
abnormal termination, exit code 8
</pre>

</div>
<div class="modal-footer">
<a href="#" class="btn" data-dismiss="modal">Close</a>
</div>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> waitid</h2>
<div class="outline-text-2" id="text-9">

<p>  int waitid(idtype_t idtype, id_t id, siginfo_t *infop, int options);<br/>
  wait与waitpid功能差不多，只是不像waitpid用-1 0 &gt;0 &lt;-1来表示是任一子进程还是组id还是进程id，而是通过idtype来指明：<br/>
  P_PID表是进程ID，此时id为进程id号<br/>
  P_PGID表进程组，此时id表进程组的id<br/>
  P_ALL表明任一进程，此时id无效<br/>
</p></div>

</div>
