Linux/LinuxCoding/process.html

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> wait3/wait4</h2>
<div class="outline-text-2" id="text-10">

<p>  pid_t wait3(int *status, int options, struct rusage *rusage);<br/>
  pid_t wait4(pid_t pid, int *status, int options, struct rusage *rusage);<br/>
</p>
<p>
  wait3 &lt;=&gt; waitpid(-1, status, options) + 资源使用情况<br/>
  wait4 &lt;=&gt; waitpid(pid, status, options) + 资源使用情况<br/>
</p>
<p>
  struct rusage定义在 /usr/include/bits/resource.h<br/>
<a href="#rusage" class="btn" data-toggle="modal">结构体rusage源码</a>
<div id="rusage" class="modal hide">
<div class="modal-header">
<button type="button" class="close" data-dismiss="modal">x</button>
<h3></h3>
</div>
<div class="modal-body">

<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">rusage</span>
  {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Total amount of user time used.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">timeval</span> <span style="color: #a0522d;">ru_utime</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Total amount of system time used.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">timeval</span> <span style="color: #a0522d;">ru_stime</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Maximum resident set size (in kilobytes).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_maxrss</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Amount of sharing of text segment memory</span>
<span style="color: #b22222;">       with other processes (kilobyte-seconds).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_ixrss</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Amount of data segment memory used (kilobyte-seconds).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_idrss</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Amount of stack memory used (kilobyte-seconds).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_isrss</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of soft page faults (i.e. those serviced by reclaiming</span>
<span style="color: #b22222;">       a page from the list of pages awaiting reallocation.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_minflt</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of hard page faults (i.e. those that required I/O).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_majflt</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of times a process was swapped out of physical memory.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_nswap</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of input operations via the file system.  Note: This</span>
<span style="color: #b22222;">       and `ru_oublock' do not include operations with the cache.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_inblock</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of output operations via the file system.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_oublock</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of IPC messages sent.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_msgsnd</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of IPC messages received.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_msgrcv</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of signals delivered.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_nsignals</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of voluntary context switches, i.e. because the process</span>
<span style="color: #b22222;">       gave up the process before it had to (usually to wait for some</span>
<span style="color: #b22222;">       resource to be available).  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_nvcsw</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Number of involuntary context switches, i.e. a higher priority process</span>
<span style="color: #b22222;">       became runnable or the current process used up its time slice.  </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ru_nivcsw</span>;
  }
</pre>

</div>
<div class="modal-footer">
<a href="#" class="btn" data-dismiss="modal">Close</a>
</div>
</div>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
